import 'package:deepcoder/Animations/FadeAnimation.dart';
import 'package:deepcoder/screen/infoWordsStudent.dart';
import 'package:flutter/material.dart';

import '../Utilite.dart';

class WordsStuents extends StatefulWidget {
  @override
  _WordsStuentsState createState() => _WordsStuentsState();
}

class _WordsStuentsState extends State<WordsStuents> {
  @override

  var data = [
    {
      'name' : ' حمزه محمد عبدالله',
      'shortName' : 'حمزه محمد عبدالله ',
      'type': 1 ,
      'title': 'كل الحروب لها نهايةة، ونهايةة الحرب السلام.. ',
      'text':"اللهم لك الحمد حتى ترضى و لك الحمد إذا رضيت ولك الحمد بعد الرضى\n بعد مرور أربع سنوات وصلت اليوم إلى نهايةة المسيرة الدراسيةة \n  وها انا أحتفل بتخرجي بدرجةة البكلاريوس في علوم الحاسوب \n أهدي تخرجي هذا \n إلى من وضع اللةه الجنةة تحت قدميها \n  ووضعتني على طريق الحياة، وراعتني حتى صرت كبيراً، \n من افضلها على نفسي فلقد ضحت من أجلي ولم تذخر جهداً في سبيل إسعادي على الدوام \n (جنتي أمي العظيمةة...♥️)  \n  إلى صاحب الوجةه الطيب، \n والأفعال الحسنةة، والسيرة العطرة، والفكر المستنير \n لقد كان لك الفضل بعد اللةه في بلوغي ما انا عليةة اليوم بدعمك المستمر لي والمستميت ولقد نلتُ ماتمنيتةه لي \n فقد اقطفت زرعك الذي انبتةهُ لي امن ساندني طوال حياتةة والذي لم يرفض لي طلباً يوماً من الأيام \n (أبي القدير...♥️) \n قد كنت لي بعد اللةه الرفيق والخليل في رحلتي هذه \n و أعلم جيداً أن الفضل بعد اللةه هو لك فقد كنت ملهمي و دليلي الروحي \n أبي أعلم أن رد الدين لك مستحيل فقد ضحيت بعمرك و كرست حياتك لأصل إلى هذه المرحلةه \n وانا أعلم علم اليقين بأنك أمامي وخلفي وواضع يدك بظهري تدفعني إلى الأمام نحو التقدم والرقي \n لولاك لما كان لي شئناً ولا وجود، فلقد حصدت الأشواك عن دربي لتمهد لي طريق العلم \n فقد علمتني الصبر والنجاح \n قد كنت النور الذي ينير لي هذا الدرب \n أبي ياسندي وقوتي وملاذي بعد اللةه، \n أنت فخري في هذه الدنيا \n أبي العزيز شكراً بحجم السماء...♥️    ",
      'image': '1.JPG',
    },
    {
      'name': 'الشهيد الحسين القاضي ',
      'shortName': 'محمد الحميري',
      'type': 1,
      'image': '2.JPG',
      'title': 'الرجل الأول في دفعة CTI ',
      'text': "االحسين القاضي رجل بحجم وطن \n وولد الشهيد الحسين القاضي في قرية الحبيل منطقة الحازة  والذي وافق عام 1996 م,  كان يوم ميلاد لرجل وطني جسور, ومعدن نادر من نوعه \n ا إلتحق الشهيد البطل بالتعليم الأساسي وهو في سن السابعة في مدرسة محمد طه ناجي أخذ ينهل من ميدان  العلم وتستقي روحة العذبة حب الوطن حتى ارتوت وطنية ونضال ودرس فيها الأساسية والإعدادية \n وما أن سمع هذا الشهيد بمركز معاذ القراني والذي تربى فيه على مائدة القران الكريم والسنة النبوية وارتوت روحه روحانية وامتلئ قلبه إيمان \n راسخ حيث أتم فيه حفظ كتاب الله عزوجل بالتزامن مع دراسته الثانوية في مدرسة ثانوية تعز الكبرى النموذجية\n  والذي وافق أول سنة له نشوب ثورة الشباب ثورة الحادي عشر من فبراير وهنا برزت روحه الثورية وكان له دور \n في الحركة الطلابية التي كانت تقود الطلاب للمشاركة في ثورتهم ثورة الشباب والتي رسخت فيهم الروح الثورية ومقاومة الإستبداد\n والمطالبة بالحرية والكرامة ، وما إن أتم دراسته الثانوية وفي عامه الفاصل بين مرحلة الثانوية والجامعة خرج جرذان الإمامة والجهل أعداء العلم والحرية والجمهورية\n والتهمت كل أحلام الشعب حتى وصلت مدينة الثقافة والحرية والثورة- تعز -التي رضع منها حريته وكرامته منذ الصغر  إلا وكعادته انظم إلى سرك المقاومين والمدافعين عن هذه المدينة والجمهورية\n والجمهورية وكان له دور في قيادة المجاميع المقاومة فيما كان يسمى بلواء الطلاب سابقا ؛شارك في العديد من المعارك في مختلف جبهات المدينة شرقها وغربها والتي أذاق فيها المليشيات الويلات هو ورفاقه\n ، وبعد عامين من نشوب الحرب وتقهقر المليشيات إلى أطراف المدينة بدأ النور يعود رويدا رويدا إلى هذه المدينة وأعلنت جامعة تعز عن فتح باب التسجيل واستئنافها للدراسة\n سرعان ما بادر الشهيد بالإلتحاق بأحد اقسامها قسم علوم الحاسوب - كلية العلوم التطبيقية \n وكان مندوب دفعته والتي غرس فيها مبادئ التعاون وزرع مبدى التعاون والروح الواحدة بين زملاءه دفعة مبرمجين ملانهايه \n كذلك كان أحد قادة الكلية حيث وكان همه وشغله الشاغل إعادة الكيان الطلابي في جامعة تعز (الاتحاد العام لطلاب اليمن - جامعة تعز) ، وتقلد منصب رئيس الإتحاد والذي قام من خلاله بعمل العديد من الفعاليات الطلابية والمطالبة بحقوقهم من الجامعة   \n  ، رغم كل هذه الإنشغالات لم تثنه ولم تحول دون مرابطته في الجبهة وقيادته للمجاميع بل وكان محبا شغوفا للجهاد ومقارعة هذه المليشيات الإمامية الصفوية وبنى مبدأ راسخا عند الطلاب في الحرية والنضال في شتى الميادين\n  ولفت  الطالب الجامعي إلى دوره في بناء الوطن والذود عن كرامته وحريته سواء في الجبهات أو في عدم السكوت عن الظلم \n وفي الثالث من ديسمبر عام ٢٠١٩ م فور اتصال أتى من رفاقه وهو في محاضرته في الجامعة يطلبون منه ان يأتي ليساندهم استأذن الشهيد دكتور المقرر وخرج مسرعا لأخذ عدته والإلتحاق بإخوانه وفي الساعة الرابعة والنصف بعد العصر  كانت الأرض على موعد في وداع هذا البطل الجسور \n وكانت السماء تحتفي بهاء وجمالا وسعادة لإستقبال هذه الروح النقية  ، وتنهد جبل هان شريان تعز المحاصرة تنهيدة حزن ووداع للأبد! وبكى كل حجر فيه لمفارقته هذا البطل الذي خاض عليه العديد من المعارك مدافعا عنه وعن دينه و مدينته وجامعته وأهله !، \n   وارتقى إلا الله شهيدا رافعا علم الجمهورية في كبد السماء ولسان حاله \n تقول وهبناك الدم الغالي وهل يغلى عليك دم ُ وارتقى إلى الله شهيدا    "
    },
    {
      'name' : ' واسعي ',
      'shortName' : 'واسعي ',
      'type': 1 ,
      'title': 'كن انت ',
      'image': '3.JPG',
      'text' :'قد يحبطك الاخرين في مشوارك \n قد يتعرض لك أصحاب الافكار الدنيئةة  \ليشتتوو تركيزك حسدا منهم \n قد يخبرك احدهم ايضاا انك سلكت الطريق الخطااء \n  والخطااء في كلامةة اساسا  \n لا تستمع لهم انت فقط من ستصير انت ،\n انت في المستقل كن صاحب القرار في ذاتك لا الاخرين \n  كن انت كما تحب ان تكون وحدك من سيحمل اعبااء الطريق\n  ووحدك من سيتحمل نتيجة اخطاائك ووحدك من ستشعر بلذذة الوصول  كن انت دائما',
    },
    {
      'name' : 'عبدالله عبدالقادر القادري',
      'shortName' : 'عبدالله عبدالقادر القادري',
      'type': 1 ,
      'image': '4.JPG',
      'title': 'وأهدي هذا النجاح لكل الأحبة!، ' ,
      'text': "ها نحن اليوم نحتفل ونجني ثمار تعبنا وجهدنا، وأحب أن أهنئ نفسي وزملائي بهذه اللحظة التي لطالما أنتظرناها طويلا                \n     _____________                  \n  وأهدي هذا النجاح لكل الأحبة! .\n أهديه لأمي سندي في هذه الحياة وسر تفوقي ونجاحي، وأهديه لوالدي الذي رسم لي طريق النجاح وسهل لي الطريق حتى وصلت إلى هدفي الأول، \n وأهديه لوطني الذي أرجوا أن نكون رافد قوي لخدمته\n وان نبقى مرابطين له في كل ثغرة من ثغراته كنا عليها حراس،\n زملائي الأعزاء تهانينا ونجاح مميز لنا!\n لازلنا في بداية الطريق وقد تجاوزنا أولى خطواته فقط، وفقنا الله فيما تبقى وبإذن الله سنكون شمعة متقدة لخدمة وحماية هذا الوطن.    "
    },
    {
      'name' : 'محمد عبدالباسط الحميري',
      'shortName' : 'محمد عبدالباسط الحميري',
      'type': 1 ,
      'image': '5.jpeg',
      'title': 'أول خطوة في الالف ميل! ' ,
      'text': "ا ما أجمل ذلك الصباح الذي كان أول يوم لي في مشواري الجامعي \n\             أحلام وطموحات وشيئ من شعور الشوق للمستقبل الذي انشده ! بدأ الشعور بثقل هذه المرحلة مع بدأ الشهور الأولى من السنة الدراسية الأولى ، وهو شعور طبيعي يعتري كل طالب لأنه يشعر حينها بالتحول من مستوى تعليمي إلى مستوى تعليمي آخر ! آخر بكل شيئ بطرقه ومعلميه , بتنوع ونضج عقول من حوله ،بتغير الأسلوب في التعليم الجامعي حيث لم تعد متلق فقط ولكن أيضا تطرح وتشارك !    \n تفهم حينها أنه لابد من تغيير طرقك في التعليم والتعامل ...الخ\n  وهي مرحلة قادرة على أن تصنع منك رجلا آخر , قائدا إن أردت ذلك !\n تفهم حينها أن يتنوع اسلوبك ما بين تعلم وقراءة وعمل طلابي ، أنشطة وفعاليات ...الخ\n تدرك أنك إن أردت النجاح لابد من السير بثلاث خطوط متوازية :\n  ١- تعليم ٢- فكر ودين ٣- علاقات ومعارف !\n تحتاج كل ذلك نعم فالتعليم هو أساس دخولك الجامعة واختيار تخصصك، والفكر والدين لتبني سورا على ما تحمله من مبادئ وفكر سليم أمام الكم الهائل من التنوع والذي فيه الكثير\n ،امن الشوائب والشذوذ! والعلاقات والمعارف لتمهد لحياة مابعد الجامعة علاقات مع دكاترتك وزملائك وطلاب كليتك والجامعة أن استطعت قيادة ومعلمين ، حينها تكون قد كسبت مالم يكسبه غيرك من الفائدة والتنوع!  \n وقبل كل ذلك الصبر والإرادة والعزيمة ! . \n     "



    },
    {
      'name' : 'إبراهيم حميد علي فرحان  ',
      'shortName' : 'إبراهيم حميد علي فرحان',
      'type': 1 ,
      'image': '6.JPG',
      'title': '👨🏻‍🎓 إنجاز  👨🏻‍🎓' ,
      'text': "ألقد اجتزت 12عاما ولكن أنجزت 4أعوام    \n\n     لذة الإنجاز أنك شخص مستقل بذاتك تحمل كتب العلم والمعرفة بشغف لتبلغ الحلم المنتظر هذه هي قصتي قصة إنجاز                 منذ اليوم الذي اجتزت إختبار القبول\n وجلوسي لأول مرة بمقعد جامعي ودخول دكتور يلقي المعلومات وخروجة ودخول الآخر  والتعرف على أصدقاء من ثقافات متعددة\n ولجهات متنوعة كل هذا زادني فهم وإدراك لمعنى الحياة أدركت حينها أن الحياة لاطعم لها بدون علم اتغيرت كثيرا عما كنت سابقا أصبحت شخصا آخر أرى العالم وكأنه يبتسم لي أرى نورا يشع أدركت أنه نور العلم \n  اتعلقت كثيرا بجامعتي، احببتها لدرجة أني كنت اتخطى العقبات للذهاب إليها عند قطع الطرق وعند إيقاف المواصلات بسبب ماتعانيه بلدي كنت أخاف كثيرا ولكني أنجزت 4أعوام بكل مافيها من معوقات سياسية واقتصادية،\n لأصل إلي ما أنا عليه الآن لأحتفل معكم بإنجازي بثمرة سهرت الليالي لاحصادها ويعود الفضل إلي الله الذي فتح لي طريق العلم  وسهل لي دربي\n  وثم عائلتي التي كانت لي دخر وسند \n ثم لدكاترتي الأفاضل لهم مني الشكر الجزيل \n ثم لكم أنتم يامن شاركتوني فرحة تخرجي.  ",


    },
    {
      'name' : 'مجيب الواصلي',
      'shortName' : 'مجيب الواصلي',
      'type': 1 ,
      'image': '7.JPG',
      'title': 'اهداء وشكر' ,
      'text': "أشكر وإهداء إلى أغلى ما أملك في الدنيا أمي وابي الغالين على قلبي   \n فمن الله ثم منهم نستمد القوة والعزيمة والإصرار \n , وإلى اخواني ونبض قلبي وسندي في الحياة \n , وإلى دكاترتي الذين بفضل الله ثم بفضلهم وصلنا إلى ما نحن فيه \n  , وتجاوزنا كل الصعاب \n ل, وإلى زملائي الذين كانوا كإخواني \n وإلى اصدقائي وكل من كان سبباً في سعادتي وشمعةً تضيء الطريق أمامي  \n , لكم جزيل الشكر والتقدير والاحترام .  ",
    },
    {
      'name' : 'جلال محمد صالح الشجاع',
      'shortName' : 'جلال محمد صالح الشجاع',
      'type': 1 ,
      'image': '8.JPG',
      'title': 'رغم ماسنقول وماقُلنا... ',
      'text': " رغم ماسنقول وماقُلنا....  \n          عن طموحٍ بنيناها بأيدينا \n  حملناها على كَتِفٍ ممزقةٍ....  \n          مطرزةً حربً حصاراً وبالآهات تحكينا \n  حملناها ولمن نعيا بحملهما...... \n        وصلنا ولساننا بالنصر تاليها \n  شكراً لكم أُمً أبً وإخوانا..... \n       من شاركونا وساندونا بالحنان       ",
    },
    {
      'name' : 'إيهاب توفيق عبد الرزاق ',
      'shortName' : 'إيهاب توفيق عبد الرزاق ',
      'type': 1 ,
      'image': '9.JPG',
      'title': 'نهاية وبداية ونصائح ',
      'text':  " جامعة تعز  لن تقدم لك كل شيء ولا أي جامعة آخرى\n   فمهمة  الجامعة\n تقتصر على أن تضع قدميك على أول الطريق وبعدها عليك أن تكمل مشوارك \n مع مزيد من الصبر والجهد والعزيمة ستصل إلى ما تريد ، المهم ً معتمدا على نفسك,\n أن تحدد هدفك وتسعى جاهدا لتحقيقه\n  ولا تنسى أنك ستواجه صعوبات كثيرة ،\n وعناء وستقابلك حواجز ، في البداية ستشعر وكأنك تسير على قدميك بترقب وحذر\n كثر من الممارسة والتطبيق ُ لذا ستكون حركتك بطيئة \n ، مع الوقت تزداد معلوماتك و ستجد نفسك أسرع وأكثر ثق ُ ة وكأنك تركب فرسا أبجر كعنترة بن شداد.      ",

    },
    {
      'name' : 'معاذ المحيا',
      'shortName' : 'معاذ المحيا',
      'type': 1 ,
      'image': '10.JPG',
      'title': 'لحظة تخرج ',
      'text': "ها أنا اليوم أقف على عتبات التخرج أحمل قبعتي عالياً بكل فخر،\n ويتوسطني وشاح العلم والنور \n .. ها هي البسمة تعانق فضاء روحي وهاهي الفرحة تضيء سماء قلبي  \n  قلبي اليوم تزدحم مشاعري فرحة بما أنجزته خلال مسيرتي الدراسية \n   أهدي تخرجي إلى قرة عيني والدي العزيز ووالدتي العزيزة تاج رأسي \n عائلتي فرداً فرداً جميع أصدقائي الطيبين \n الطيبين وكافة الدكاترة كل من علمني حرفاً  \n   وكما أبارك من ثنايا قلبي جميع أصدقائي الخريجين \n  متمنياً من الخالق أن نكون سنداً لهذا الوطن ",
    },
    {
      'name' : 'انس العديني',
      'shortName' : 'انس العديني ',
      'type': 1 ,
      'image': '11.JPG',
      'title': ' غذاء العقل',
      'text': "لقد ميز الله الإنسان وكرمه عن سائر خلقه بالعلم وجعل العقل أداة العلم وأداة للتفكير والتحليل وخزن المعلومات واستردادها \n وزود الله العقل بملايين الخلايا الدماغية والشبكات المعلوماتية \n لذلك كان العقل من دلائل قدرة الخالق عز وجل وبه يقيم الله تعالى الحجة لك أو عليك أيها الإنسان. \n  ويقتـرن العلم بالعقل دائمًا .. فإن كان العلم قويًا ونافعًا كان العقل ناضجًا. \n كما جعل الله العلم غذاءً للعقل بدونه يضعف العقل وتتلف خلايا الدماغ. \n فإن أردنا توسيع مداركنا وإدراك ما حولنا فعلينا بالاستزادة من العلم والاستمرار في القراءة، \n فللقراءة دور كبير في صناعة العلماء والمخترعين والموهوبين والمبدعين \n ولذلك كان أول أمر أمر الله به نبينا صلى الله عليه وسلم وأمر به هذه الأمة هو الأمر بالقراءة \n  (اقرأ) وكانت المعجزة الخالدة التي أيده الله بها إلى آخر الزمان\n هو القران الكتاب المُعجز بكل حرف منه وبكل كلمة وبكل آية وسورة.\n فلا بد من القراءة باستمرار ولابد أن يكون 60 % على الأقل من قراءتك لتطوير نفسك \n واستكشاف كل جديد في مجال تخصصك \n  و 40 % من قراءتك لتقوية ثقافتك في المجالات الأخرى.   ",
    },
    {
      'name' : 'هاني الشاعبي',
      'shortName' : 'هاني الشاعبي',
      'type': 1 ,
      'image': '12.JPG',
      'title': 'بعد أيام ',
      'text': " بعد أيام ستنتهي تلك اللحظات الجميلة،\n سترحل ضحكاتنا معنا إلى عالم كبير غير ذلك العالم الذي اعتدنا عليه، \n ، الذي احتوانا سنوات عدة، قضينا فيها أروع أيامنا وأجملها، \n ، ستبقى كراسينا التي كانت شاهدة على أروع أيامنا ستبقى وحيدة،\n سنرحل عنها إلى الأبد، \n لن نعود إلى جامعتنا، \n ، ستبقى جدران تلك المدرجات حزينة لفراقنا،\n تلك الجدران التي لطالما عبثنا بها فزيناها وجملناها، واليوم نرحل لنتركها وحيدة، \n كل زاوية في جامعتنا شاهدة على جميع أحداثنا: فرحنا، وحزننا، ومغامراتنا،\n ، سنفتقد الكثير ممن كانوا معنا رفقاء الدرب و الدرس،\n ، ولكن فرحة التخرج و النجاح ستعوضنا، \n لأننا سنرتدي عباءات تخرجنا، \n ونسمع أصوات تصفيق من حولنا،\n ونرى فرحة أمهاتنا لنا\n ، فهذه هي اللحظات التي انتظرناها، سنرفع قبعات تخرجنا توديعاً،\n لسنوات جميلة مضت، فيارب تمم فرحتنا بتفوقنا،\n ، واجعل النجاح حليفنا بالقادم من حياتنا العملية   ",
    },
    {
      'name' : 'بندر',
      'shortName' : 'بندر',
      'type': 1 ,
      'image': '13.JPG',
      'title': 'اهداء ',
      'text': "بعون الله أنهيتُ هذه المرحلة من حياتتي\n والذي قدمت لي أشخاص اعتز وافتخر لمعرفتي لهم\n فهم اروع ماصدفت في دراستي احبكم من أعماق قلبي\n اهدي هذا الإنجاز \n الي كل أفراد عائلتي عنهم أبي الغالي وأمي الحبيبة  الذين بذلوا الغالي والنفيس \n من أجل إنهاء هذا المشوار الذي دام اعوام عديده\n  وأخوتي  \n عنهم اخي الكبير الذي كان له الدور الأكبر في  تقديم الدعم المادي \n والمعنوي.  وجميع اصدقائي الذي وقفوا بجانبي اشكركم من اعماق قلبي.      ",
    },
    {
      'name' : 'حسان فيصل الاصبحي',
      'shortName' : ' حسان فيصل الاصبحي',
      'type': 1 ,
      'image': '30.jpeg',
      'title': 'النجاح  ',
      'text':"لا يصل الناس إلى حديقة النجاح\n والتخرج دون أن يمروا بمحطات التعب  \n والفشل، واليأس وصاحب الإرادة القوية لا يطيل الوقوف في هذه المحطات ، \n بل يجعلها نقطة انطلاق ويتعلم من تجاربة \n فقد قيل (من لا يخطأ لا يتعلم) \n والخبرة هي عبارة عن أخطاء سابقة نتعلم منها للمستقبل ، \n فالحياة مدرسة ومن جد و جد ومن زرع حصد     ",
    },
    {
      'name' : 'كارم الرعيني',
      'shortName' : 'كارم الرعيني',
      'type': 1 ,
      'title': 'وها نحن اليوم نحصد ما زرعنا ',
      'image': '15.jpg',
      'text': "لقد انطوت إحدى صفحات مسيرتنا التعليمية \n واستطعنا بفضل الله ثم عزيمتنا أن نصل لمبتغانا \n وها نحن اليوم نرفع قبعاتنا فرحا بوصولنا وفخرا بأنفسنا  \n التي لم تكل من التعب ، \n علمنا بان المطالب لا تؤخذ بالتمني فغالبنا الدنيا حتى وصلنا وها نحن اليوم نحصد ما زرعنا  \n ،نرفع قبعاتنا اجلالا واكراما لكل من علمنا وساندنا  \n ونودع رفقة قضينا اجمل أوقاتنا معهم حاملين أحلاماً  \n كبيرة في صدورنا متجهين لتحقيقها في مستقبلنا   ",
    },
    {
      'name' : 'رأفت أمين أحمد على',
      'shortName' : 'رأفت أمين أحمد على',
      'type': 1 ,
      'title': 'يوم التخرج يوم موعود ويوم حصد ثمار التعب ',
      'image': '16.jpg',
      'text' : "ها قد قرب يوم التخرج الذي انتظرناه طويلاً\n اٍنه اليوم الموعود الذي نسهر الليالي ونتعب لأجله لنحصد ثمار التعب ، \n واليوم الذي أعددنا له الفرح والأمنيات ، \n ، ففي هذا اليوم تختلط المشاعر ما بين الفخر الكبير الذي كنا ننتظره بفارغ الصبر \n وما بين الفخر الذي نراه بعيون الآباء والأمهات والعائلات ، \n وما بين شعور الثقة الكبيرة الذي نلمسها في أعماقنا ،  \n لأننا تجاوزنا كل شئ ووصلنا اٍلى  مانريد ، \n فالتخرج بداية جميلة للحياة العملية التي تتطلب تحديات كثيرة واٍعداداً صحيحاً لأجل البدء بنجاح وعزيمة  \n ولايمكن لأي كلمات أن تصف فرحة التخرج التي تشعل القلوب بالبهجة والسرور \n   فالتخرج هو النجاح المنتظر والذي يتمناه الجميع     ",
    },
    {
      'name' : 'سليم هزبر',
      'shortName' : 'سليم هزبر',
      'type': 1 ,
      'title': 'اشكر الله ',
      'image': '17.jpg',
      'text' :"لحظات الختام أقف على أبوابها وأقول لها كم كنتِ متعبة ومليئة بالعثرات \n لكن كان لُطف الله يصاحبني في كل خطوة أخطوها..، \n رغم تقصيري إلا أني أرى رحماتُ الله تتنزل علي بالتوفيق لأنه يعلم جهادي وهذا لأجل ذلك الحلم الذي يُلوح لي من بعيد وينتظرني.. \n   شكرًا لكل من رافقني   \n خلال هذه الاعوام وواساني وكان كتفًا أسندني حال سقوطي       ",
    },
    {
      'name' : 'ايمن العامري',
      'shortName' : 'ايمن العامري',
      'type': 1 ,
      'title': 'مبروك التخرج كلمة توقظ كل الجروح والآلام ',
      'image': '18.jpg',
      'text' : "مبروك التخرج كلمة توقظ كل الجروح والآلام التي صاحبتنا لسنين !!\n مبروك النجاح كلمة تحول الجروح والآلام إلى أفراح وآمال ..  !!  \n لن تصل إلى النجاح دون أن تحفر في الصخرة الصماء ، دون أن تلعق الصبرا  .. ،  \n ، دون أن تمر بمحطات التعب والسهر والضغوط النفسية والإحساس باليأس والفشل ... \n كل الخريجين يهدون نجاحهم  .. !  ولكني سأهدي فشلي  !  \n للمثبطين و ( المحبطين ) من كانوا يحاولون ايقافي في وعرت هذا الطريق ! \n بفضل الله ، وبدعاء الوالدين  ، بالإرادة القوية  .. لم نطل الوقوف على جسر الخطر وعبرناه رغم وعورته .. !! \n سنرتدي عباءات تخرجنا، ونسمع أصوات تصفيق من حولنا، ولنرى فرحة أمهاتنا وأبائنا بهذه اللحظات التي انتظرناها طويلاً ، سنرفع قبعات تخرجنا توديعاً للماضي واستقبالاً للمستقبل  \n لا شيء يضاهي فرحة التخرج ؛ فهي من أجمل اللحظات التي تمرّ بحياتنا \n ، فتعب السنين وسهر الليالي وما مررنا به من ضغوطات  قد زالت ونسيناها بمُجرّد شعورنا بفرحة التخرج \n    #دفعة_C. T. I   ",
    },
    {
      'name' : 'عماد حامد الوهباني',
      'shortName' : 'عماد حامد الوهباني',
      'type': 1 ,
      'title': 'نحمد الله ونشكره مليون مرة',
      'image': '19.jpeg',
      'text' : "نحمد الله ونشكره مليون مرة\n والدعاء ذللت كل الصعاب \n والنتائج أكملت طعم المسرة، منها للأعلى \n افرحوا يا أهل التميز، والكفاح من تعب يحصد زهور وياسمين، \n ،          والعمل يجني تباشير النجاح        ",
    },
    {
      'name' : 'محمد سعيد ',
      'shortName' : 'محمد سعيد ',
      'type': 1 ,
      'title': 'الفشل، واليأس',
      'image': '20.jpg',
      'text' : "لا يصل الناس إلى حديقة النجاح، دون أن يمروا بمحطات التعب، والفشل، واليأس،\n وصاحب الإرادة القوية لا يطيل الوقوف في هذه المحطات  \n وأخيرًا سنرتدي عباءات تخرجنا ونسمع أصوات التصفيق ممن حولنا ونرى فرحة من هم الأقرب الي القلب بنا. \n وفي هذه اللحظة التي انتظرناها طويلا فها نحن نرفع قبعات التخرج توديعًا لسنوات جميلة بحياتنا قد مضت،  \n في هذه اللحظات نستقبل التهاني العلمية المكللة بعقود الفل والزهور التي لاتنسى، ،  \n أدعو الله أن يتمم فرحتنا بهذا التفوق وان يوفقنا في حقل العمل ولخدمة هذا الوطن الجريح.            ",
    },
    {
      'name' : 'باقادر هزاع السبئي ',
      'shortName' : 'باقادر هزاع السبئي ',
      'type': 1 ,
      'title': 'أخطو والعمر يخطو بين الحقيقة والحلم ',
      'image': '21.jpg',
      'text' :"الحلم الذي اصبح حقيقة وأصبحت أحوم حولها  فتذكرت خطوات الماضي\n والحاضر الذي سأحقق فيه أمنياتي ورؤيتي للمستقبل الذي ينمو كالشجرة وأغصانها الخضراء التي تتراقص حينما أغني بحروف علمي \n وبالتمني الذي أنطقه الكفاح رأيتُ الجامعة ولم أكن أعلم أني سأحوم حولها وسأغني في مغانيها الجميلة \n ، ثم تذكرت حالي وحال أصدقائي أيام الإختبارات حينما تعلو الصيحات في القاعة والساحة بين السهل والصعب \n وكيف نسلم الأوراق بسعادة أو بحزن   فتنقضي أيام بين السهر والخوف. \n بعد التوفيق من الله وبالصبر والقلوب النيرة وبعد مرور الأيام والشهور والسنوات \n أقف الآن بكل فخر وإعتزاز أحمل شهادة التخرج  \n ولا ينبغي أن أنسى أن والديّ هم من قاموا بدعمي ومساعدتي للوصل إلى هذا المكان   \n فهم يكرثّون قوتهم طوال فترة دراستي لتشجيعي \n كل الشكر والإحترلم والتقدير لعائلتي وأصدقائي وأساتذتي.    ",
    },
    {
      'name': 'صهيب عبدالقوي الفهيدي ',
      'shortName': 'صهيب عبدالقوي الفهيدي ',
      'type': 1,
      'title': 'جائت اللحظة المنتظرة ',
      'image': '22.jpg',
      'text': "ها قد جائت اللحظة المنتظرة، لحظة الجمال التي لطالما حلمنا بها كثيرا لنتجاوز هذه المرحلة من حياتنا!\n لقد كانت مرحلة عظيمة تجاوزنا بها الكثير من الصعاب وتعلمنا منها الكثير من الدروس والعبر، \n قابلنا فيها شخصيات غيرت من حياتنا وغيرت من تصورنا للحياة وتعلمنا من خلالها الكثير من المهارات القيادية والإدارية \n  وأسسنا فيها قاعدة الإنطلاق لهذه الحياة \n شكرا لكل من أخذ على يدي لكي أصل إلا هذا النجاح! \n  شكرا لكم والداي العزيزان أهنئكم بهذه الفرحة التي هي فرحتكم قبل فرحتي \n وشكرا لكل الأحبة والأصدقاء! \n مبارك لنا هذا النجاح!   ",
    },
    {
      'name': 'سيف الشميري ',
      'shortName': 'سيف الشميري ',
      'type': 1,
      'title': 'إليك يا سيدتي ',
      'image': '23.jpeg',
      'text':"إليك يا سيدتي ومولاتي وأميرتي وملاكي الطاهر وعشقي المقدس \n أهدي تخرجي وكلماتي تنحني إجلالاً لك أيتها الرحمة والحنان والعطاء إليك يا غاليتي ( أمي  ) \n  أنا بحاجة إلى أن أقبل قدميك واحتضنك يا سلطانتي ويا من تعبتي وسهرتي وصليتي ودعيتي الله من اجلي \n فظك الله يا أمي ورعاكي وجزاكي عني خيراً .\n وإليك يا حبيبي يا أبي إلى روحك الطاهرة  يا من  أوجعني رحيلك  \n ليك أهدي تخرجي ولك دعواتي وقبلاتي وعليك صلواتي. وأليكم يا أخواني وحمي ظهري وذخري وثروتي العظيمه. \n وإلى اصدقائي وزملائي وجميع أحبائي ومن شجعني وساندني ولم يترك يدي \n وهنا أقول الرحلة لم تبدأ والدرب لم ينتهي وما التوفيق إلا من الله    ",
    },
    {
      'name': 'حاتم الشغدري ',
      'shortName': 'حاتم الشغدري',
      'type': 1,
      'title': '#نسائم آمالنا وانوار دروبنا ',
      'image': '24.jpg',
      'text': "من بين عتمات الحياة انبلج حلم رسمته الروح وشغفت به شغاف افئدتنا فوسم على جبين قلوبنا ب نسائم سحره ظلت سويداء القلوب تتطلع   الى النور الذي وهج ضياؤه من بين غياهب الظلام\n لايعيقها عن حلمها الاسمى عائق ولايثنيها عن مطلبها اﻷسمى الذي هوته الروح بقناعة تامة لاتحيد ولاتزيغ عن نيل مبتغاها فآمالنا استمدت النور من مصدر النور الالهي الذي اهتدت بنوره قلوبنا وارواحنا فتلاشى واضمحل كل غيهب وعائق يثنينا عن حلمنا  \n . اعتذر من كل زميل وزميلة عن اي تصرف صدر مني او سوء فهم بقصد او بغير قصد  \n اهدي تخرجي الى الروح التي سكن حبها في حنايا الروح (امي الغالية) والى  (والدي الذي توسم  على جبين روحي) \n والى  (اخواني)  الذين كانوا سندي في كل حال وموقف \n والى كافة  (اهلي)وكل (غال)    \n على الروح ساندني في تحيقق احلامي وآمالي         ",
    }
  ];
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: UtiliteColor.color1,
        title: Text('كلمة طلاب الدفعة',style: TextStyle(fontSize: 17,color: UtiliteColor.color5),),
      ),
      body: ListView.builder(
          itemCount: data.length,
          itemBuilder: (BuildContext ctxt, int index)
          {
            return Padding(
              padding: const EdgeInsets.only(top: 5,bottom: 5,right: 5,left: 5),
              child: FadeAnimation(.5, Container(
                color: UtiliteColor.color2.withOpacity(.7),
                child: Padding(
                  padding: const EdgeInsets.all(5),
                  child: ListTile(
                    onTap: (){
                      Navigator.push(context, MaterialPageRoute(builder:(context)=>infoWordsStudent(data: data[index],)));
                    },
                    title: data[index]['type']==1?Text("الخريج : " +data[index]['name'],style: TextStyle(fontSize: 15),)
                        :Text("الخريجة : " +data[index]['name'],style: TextStyle(fontSize: 15),),
                    leading: ClipRRect(
                      borderRadius: BorderRadius.circular(30),
                      child: data[index]['type']==1?Image.asset('assates/images/icons3.png'):Image.asset('assates/images/icons1.png'),
                    ),
                    trailing: Icon(Icons.arrow_back_ios),
                  ),
                ),
              ),
              ),
            );

          }),
    );
  }
}
