import 'package:deepcoder/Animations/FadeAnimation.dart';
import 'package:deepcoder/screen/infoWordsStudent.dart';
import 'package:flutter/material.dart';

import '../Utilite.dart';

class WordsStuentsW extends StatefulWidget {
  @override
  _WordsStuentsState createState() => _WordsStuentsState();
}

class _WordsStuentsState extends State<WordsStuentsW> {
  @override

  var data = [
    {
      'name' : 'أفراح صادق',
      'shortName' : 'أفراح صادق',
      'type': 2 ,
      'title': 'إنتهت المرحلة الجامعية ',
      'image': 'afrhh.jpg',
      'text' : "ها قد إنتهت مرحلة من مراحل حياتنا \n إنتهت المرحلة الجامعية - إنتهت كل تلك اللحظات الجميلة \n رحلت ذكرياتنا معنا \n , وبقت الجامعة شاهدة على أيام فرحنا وهمنا قلقنا وسعادتنا   \n ,أيام كان الجد والإجتهاد  رفيقا لنا على الدوام رغم الصعاب التي واجهتنا.\n وها نحن الأن نرتدي عباءات تخرجنا \n ..ونرى فرحة اهالينا .. ونرفع قبعاتنا ..توديعا لسنوات مضت .  \n      وأخيرا أتوجه  بالشكر   \n لكل من كان له الفضل في تحقيق احلامي ووصولي الى هذا اليوم الفارق في حياتي  \n شكرا لكم.  ",
    },
    {
      'name' : 'أمل الفقيهٍ ',
      'shortName' : 'أمل الفقيهٍ',
      'type': 2 ,
      'title': 'بالصبر والإخلاص والايمان  ',
      'image': 'aml.jpg',
      'text' : "بالصبر والإخلاص والايمان ...  \n بالعزم والإصرار والاتقانِ  \n نجني ثمار غراسنا وجهودنا ..\n وبواعث الكلمات ملء لساني \n ودفاتر الأيام تروي قصة ... \n عن صرحنا في صفحة الازمان\n خريجة أمضي بدرب ثابت ... \n نحو المعالي همتي بكياني \n خريجة أرنو كطائر بلبل ... \n يشدو على الأكوان بالألحانِ\n ألقٌ من الذكرى تسطر أحرفي... \n                تلك الجهود وفرحتي ببياني        ",
    },
    {
      'name' : 'ابتسام نجيب',
      'shortName' : 'ابتسام نجيب',
      'type': 2 ,
      'title': 'بعد أربع سنوات ',
      'image': 'abtsam.jpg',
      'text' : "بعد أربع سنوات من الجد والاجتهاد والمثابرة\n مرت الأربع السنوات بلمح البصر  \n ونحن نجري ونسعى لتحقيق الأحلام والأهداف التي حلمنا بها \n ها انا اليوم اقف خريجة وارفع قبعتي بكل فخر \n           وبعد توفيقٌ من الله اهدي تخرجي \n لمن كان لهم الدور الاكبر في دراستي الى سندي الاول ابي الغالي  وامي الغالية \n وكذالك لمن شجعني على مواصلة تعليمي وتحقيق اهدافي زوجي الغالي \n وكذالك الى اخواني واخواتي\n واهدي تخرجي ايضا الى نفسي التي كافحت وصارعت من اجل تحقيق اهدافها \n ...وفوق هذا كله و اولا واخيراً الشكر لله تعالى.     ",
    },
    {
      'name' : 'إيمان المغلس',
      'shortName' : 'إيمان المغلس',
      'type': 2 ,
      'title': 'مبروك لنا تخرجنا',
      'image': 'eman.jpg',
      'text' : "        لنا سنين ياطلاب            نسعى بكل جوارحنا\n      لطلب العلم سافرنا           وتركنا الأهل والأصحاب \n    وكم من مرة لا ندري         أيوجد في الطريق أمان؟ \n  ومع ذلك جازفنا              وسرنا لنحقق الأحلام \n وفي وباء من الأمراض          سرنا ولا نبالي بها \n فلا لليأس طريق لنا           فنحن في ربا الأمجاد \n فكم سهرنا من أيام              وحققنا مطالبنا \n وفي توفيق من الرحمن        وصلنا إلى هنا بأمان \n وبكل فخراً نقول الآن  \n              مبروك لنا تخرجنا     ",
    },
    {
      'name' : ' بنان نبيل اليوسفي ',
      'shortName' : 'بنان نبيل اليوسفي ',
      'type': 2 ,
      'image': 'bnhn.jpg',
      'title': 'نهاية البداية لاحلامنا فألف مرحى ',
      'text' : "وجاء يوم التخرج وابتساماتنا زينت ثغر السماء\n تثاءب النهار من فم التعب \n واتكأ النعاس على عكاز النصب \n ها نحن نرتل ونغني ونسابق الوقت لينهض صباح حفلنا ونغسل وجوهنا بندى الفرح... \n ايامنا الحالكات بالجد والاجتهاد ها هي تينع بنجاح وتألق  \n وها هو الوقت يقطع اوتاره \n ليرسم على صدورنا قصائد الألق  \n               نهاية البداية لاحلامنا فألف مرحى        ",
    },
    {
      'name' : 'حنين الفخري',
      'shortName' : 'حنين الفخري',
      'type': 2 ,
      'image': 'hnen.jpg',
      'title': '"من نحن؟!" ',
      'text' : " 	- نحن الحياة في وسط موت الحروب ... \n    نحن زارعون احلامنا في وسط القلوب   \n   وعلى أمواج الظروف العاتية عزمنا الركوب ... \n   وأقسمنا عن رغبة الوصول والشغف لن نتوب \n نحن الذين لم نجعل لليأس علينا سبيلا.. \n وعند كل عثرة نهضنا ورددنا: \n لا بأس لو عثرت خطى الأكارم حتى يعرفوا السددا... \n فجبلت أرواحنا على حب الانتصار والعطاء..  \n وشددنا أيدي بعضنا حتى عبرنا... \n نحن الجامعيون أصدقاء المحاضرات الصباحية ... وأصحاب زحمة ممرات الكلية ... \n أصدقاء أزمات المواصلات... وأوراق المحاضرات..  ورهبة الاختبارات.. \n نحن من سوفنا وتكاسلنا مرات...  \n ولكن عشقنا الإنجاز في آخر اللحظات... \n نحن أصدقاء الرموز الرياضية... والأكواد البرمجية... والمشاكل الحاسوبية..  \n      نحن المبرمجون الى مالانهاية ...    \n       نحن خريجون \n CTI                     \n We won’t stop until we become proud of ourselves -    ",
    },
    {
      'name' : 'حلوم الفهيدي',
      'shortName' : 'حلوم الفهيدي',
      'type': 2 ,
      'image': 'hlemh.jpg',
      'title': '*حديث مبرمج*  ',
      'text' : "كم هو عظيم أن تقف شامخا حاملا على رأسك قبعة التخرج،\n  يدك قابِضةٌ شهادةاِنتظرتها طويلا، واجهت من أجلها  \n كل رياح البرمجة التي عصفت بك في أغلب الأحيان \n تجاوزتها  بسهر ليالٍ عدة، ونمت فترات متقطعة على أوراق  ملازم متعديدة \n قطعت طرقا طويلة وحيدًا، شارد   بين الجافا   والسي شارب،  \n    قلبك مائل    \n    بين إكزامرين وفلاتر   \n وقتك تبذله في تعلم الويب \n شغفك حائر بين الإندرويد والفجول؛  \n لتصبح كلماتك أكواد برمجية ويأتي اليوم الموعود معلن تخرجي   ",
    },
    {
      'name' : 'رانيا طه الشميري',
      'shortName' : 'رانيا طه الشميري',
      'type': 2 ,
      'image': 'ranea.jpg',
      'title': 'العلم باق  ',
      'text' : "حين نقوم بالتفكير عن كل الطرق التي ركضناها باستعجال فيما مضى\n لأجل اللحاق بمحاضرة صباحية أواختبار جامعي او مقرر \n أثقل في كاهلنا كل تلك الخطوات مشيناها اليوم  بلحظات متأملة بقلب متسارع نبضاته \n بخطى بطيئة بخطى حذرة لأجل أن تحفظ صدى صوت أقدامنا الاخير  \n والأماكن تودعنا ملوحة بابتسامةوألفه رسمت ع وجدان المكان بنظره حب اخيرة ؛ \n تخزن في زواياها هذا المشهد الدرامي  الاخير ها قد وصلنا الى يومنا الاخير \n اليوم الذي سنطوي فيه الصفحات وكل المراحل التي خضناها كعناوين رئيسية لاتتبع بالفواصل ولا تنتهي بالنقاط  \n سيبقى اثرنا ستخلد هذه الذكرى \n سيحمل في ذاكرتنا اوقات تذكرنا كم صبرنا وكم خضنا صراعات مع الظروف ... \n تارة انتصرنا وتارة أخرى هزمتنا لكننا تعلمنا كيف ننهض من جديد  \n      ها قد أتت خاتمتنا ها قد اقبل يوم فرحنا اليوم    \n   نقول :العلم باق ونحمله فينا أملنا دائم مستقبلنا واعد وأثرنا مستمر نحن نستحق      ",
    },
    {
      'name' : 'ربا الحسني ',
      'shortName' : 'ربا الحسني ',
      'type': 2 ,
      'image': 'rba.jpg',
      'title': '   ها نحن وصلنا الى عتبة أحلامُنا  ',
      'text' : "ها نحن وصلنا الى عتبة أحلامُنا بعد أميالٌ طويلة قطعناها ،\n       وأيامٌ عجاف مررنا بها \n ومصاعب كادت تهدم سقف طموحنا \n اجتزناها ؛ لرغبتنا المُشتعلة في إكمال رحلتنا ... \n لا ننسى أشياء ، ومواقف جميلة مرت علينا واستمتعنا بها جداً  \n وأخيراً بعد كل تلك السنوات ها أنا أجني ثمار تعبي ، \n وجهدي ، واجتهادي وبدأت بنسيج الحلم الذي رسمته أمام عيني  \n  ، لن أنسى من كان لهم النصيب الأكبر لما وصلت ُ له ، \n      شكراً لعائلتي جميعاً .          ",
    },
    {
      'name' : 'رهام منير',
      'shortName' : 'رهام منير',
      'type': 2 ,
      'image': 'rhalmner.jpg',
      'title': 'أوراق ملونة ',
      'text' : " سنزهو سنحلق ونعانق السماء الزرقاء وسنخبرها بفرحنا \n وتخرجنا بأننا أردنا فكان ما أردنا فلله الحمد. \n سنلون طموحنا بالإرادة السحرية ونحن نبحر في هذا العالم  \n سنلون فراق الزميلات الرائعات بألوان آمال اللقاءات الزاهية \n سنشدو بالثناء والامتنان لأساتذتنا الأماجد الذين وقفوا معنا برغم الضبابية والاجواء الغائمة \n وستزهر أزهارنا الملونة في آفاق العمل والحياة  \n وعندها سنلون مشاعرنا بكل الألوان لتغدو كالتيجان فوق رؤوس أهلينا  \n         فلله ثم لهم الفضل والمنه      ",
    },
    {
      'name' : 'رنا عبد الرحمن حاجب',
      'shortName' : 'رنا عبد الرحمن حاجب ',
      'type': 2 ,
      'image': 'rnaa.jpg',
      'title': 'الأيام التي تكسرك هي ذاتها التي تصنعك، ',
      'text' :"مرت أيام شعرت فيها بأن كل شيء مغلق،\n حينها قررت ان أضع حدود لذلك الخوف والضعف والشتات، \n لأجد نفسي أداوي جراحي وأواجه الصعوبات أمامي، \n نعم هذه أنا بنت ذلك الأب الذي صنع مني انسانه قوية، \n انتهت حصاد اللحظات التي اعتقدت أنها لن تمر.. \n وها أنا أجد نفسي قد وصلت لذلك الهدف لبداية مستقبل مشرق، \n  والحلم الى وطن تفوح منه رائحة الأمل والعمل على تطويره \n ان أتيحت الفرصة لنكون من صناعه وبنائه ونعلو به عالياً   ",
    },
    {
      'name' : 'رهام عبد الخالق الحكيمي ',
      'shortName' : 'رهام عبد الخالق الحكيمي',
      'type': 2 ,
      'image': 'rhamabod.jpg',
      'title': 'اهداء..',
      'text' : "إلى كل من كان عكازتي وقت السقوط  \n ومطري بعد غيمًا كثيف اِعتراني، \n     من كان عالمي عندما هجرني العالم كله \n وملاذي الآمن في ذِرْوَةِ خوفي، من لم يتركُ يدي في منتصفِ الطريق  \n فهو جسري الذي يُمكنني من العبور  \n      من كان معي في كل الفصول \n وشاحًا أحتمِي به من قرص الشتاء، وغيثًا يبدد قيض صيفي، \n كان خزاني الاِحتياطي عندما فاض كيلي إلى غير محمله، \n     إلى فضائي الوسيع،  \n  ‏إلى من جعلني أشعر بأني كالشمسِ شروقي قوّة وغروبي جمال...  \n         أهدي فرحة تخرجي لكم.              ",
    },
    {
      'name' : 'سارة الشميري ',
      'shortName' : 'سارة الشميري',
      'type': 2 ,
      'image': 'sarh.jpg',
      'title': 'بدأت أكتبُ ..',
      'text' : "بدأت أكتبُ ،، فتبعثرت كلماتي أمام موقفي العظيم الذي وصلت إليه،، \n هو أنني أرفع قبعتي اليوم لتكون دليل على نهاية مشواري مع مستقبلي وهدفي التي رسمته مخيلتي ،،  \n          ومن مثلي اليوم ..؟     \n يقف على عتبة التخرج ليبدأ منجزاً بعد أن كان يحبو خطواته ليصل. \n           شكر خاص   \n خاص لوالداي الكريمين والحبيبين الداعمين لي في مشواري هذا  \n     ثم لي ثم لجميع من كان يداً تمسك بي لأصل.        ",
    },
    {
      'name' : 'سمر صادق  ',
      'shortName' : 'سمر صادق',
      'type': 2 ,
      'image': 'abtsam.jpg',
      'title': 'هل يجدي نفعا... ',
      'text' : "هل يجدي نفعا أن تقول لغريق تغمره المياه تنفس أنت أقوى من الماء دون أن تمد إليه يدك لتنقذه؟ \n        كذلك. كنا..   \n نحن من نغرق ومن ألقى بنا يشجعنا..   \n    لكن لم نغرق..  \n اكتشفت أن ما كان سيئ بنظري جميل وأن ما كان جميل قبيح..  \n اكتشفت أن من كان معي ب داع فهو ليس معي بالفعل.!! \n            ف شكرا أبي شكرا أمي   \n     أحبكما كثيرا. أبنتكما...        ",
    },
    {
      'name' : 'شيماء الشميري   ',
      'shortName' : 'شيماء الشميري',
      'type': 2 ,
      'image': 'shema.jpg',
      'title': 'كلمة خريجة',
      'text' : "التخرج كضوء الصباح تراه مع شقشقة انتصاراته\n وتنصت إلى تغريد إنجازاته وتلمس نتائجه على أرض الواقع \n ولا يمكنك أن تحجب ضوأه\n وكما قال أسلافنا من جد وجد ومن سار على الدرب وصل وخير السبل سبيل العلم \n لكل من علمني وأنار لي الطريق ما نحن اليوم  \n      إلا ثمار صنعتها أيديكم فلكم جزيل الشكر  \n   الأخير فالتخرج نهاية لرحلة قصيرة وبداية لننسج منها مستقبلنا.       ",
    },
    {
      'name' : 'شذي سامي ',
      'shortName' : 'شذي سامي',
      'type': 2 ,
      'image': 'shatha.jpg',
      'title': 'ها أنا الآن أقف على مشارف أربعة أعوام ',
      'text' : "ها أنا الآن أقف على مشارف أربعة أعوام قضّيتها في باحة كليتنا\n أقف ناظرةً لتلك العقبات والصعوبات التي تلاشت أمام فرحتي لهذا اليوم ... \n لم يكن سهلاً وصولنا لقبعة التخرج ولم تكن التحديات والأوضاع التي نشهدها لتثنينا عن عزمنا وإصرارنا لنكمل المسير ...  \n وها أنا الآن فخورة ومليئة بشعور الحب والامتنان لتلك الظروف التي صنعتني ولكلّ يد ساندتني ووقفت بجانبي.. \n لعائلتي الكريمة السند الأول ولرفاق الدرب الذين جعلوا للطريق معنى...  \n وأرجو من الله أن أكون أثراً طيباً أو بذرة تغييرٍ زُرعت في قلب أحدهم ...  \n وفي آخر هذا الطريق ومن دون تأنيب ضمير \n       #هيّا نهرب ونخلي الجامعة لهم               ",
    },
    {
      'name' : 'مي العريقي  ',
      'shortName' : 'مي العريقي',
      'type': 2 ,
      'image': 'me.jpg',
      'title': 'أصدقاء المشوار أهم وأعظم من أصدقاء الوصول',
      'text' : "قضيتُ الشطر الأول من حياتي أفتش عن صديقٍ ينظر \n إلى أصدقائه بعين غير العين التي ينظر بها التاجر إلى سلعته \n من اعنيهم ليسوا الأصدقاء الذين نتشارك معهم القاعة الدراسية \n     من اعنيهم اصدقاء المشوار، \n      الذين ساندونا بكلمة،   \n وصببنا عليهم جل  ضغوطاتنا الدراسية فتحملوها معنا دون كلل أو ملل ..   \n هم أولئك النوع من الأصدقاء الذين يسألوننا بلهفة  \n ( حباً وطمأنينة لا حسداً وغل )  \n عن معدلنا في مادة طالما تخوفنا منها، الذين تظللنا دعواتهم في كل وقت،  \n هذا النوع من الناس الذين جاءت بهم الأقدار إلى حياتنا دون ترتيب مسبق منا،  \n  وانتقيناهم بناء على  وجود كيمياء غريبة بيننا .  \n ممتنة للأقدار التي جلبتكم في طريقي \n ، ووفرت علي مشقة التفتيش عن صداقة مؤقتة بساعة رملية !       ",
    },
    {
      'name' : 'محفوظة المحمدي  ',
      'shortName' : 'محفوظة المحمدي',
      'type': 2 ,
      'image': 'Mahfouda.jpg',
      'title': 'شكرا',
      'text' : "مهما تقدمت وفتحت أمامي الطرق ووصلت لكل ما أحلم به \n سأتذكر من كانوا سبباً في نجاحي وساندوني \n وكانوا تحفيزاً لي (عمي وخالتي)  رحمة الله تغشاهم وجعل مثواهم الجنة، \n      ولوالداي وزوجي وإخوتي   \n فبعون الله وبفضله وبهم تم وصولي وها أنا الآن  \n     أرفع قبعة تخرجي.    ",
    },
    {
      'name' : 'وهيبة شائف اليوسفي ',
      'shortName' : 'وهيبة شائف اليوسفي',
      'type': 2 ,
      'image': 'whebh.jpg',
      'title': 'اللحظات التي كُنا ننتظرها ',
      'text' : "اللحظات التي كُنا ننتظرها كثير بفارغ الصبر ها هي تأتي لتحقيق أحد احلامنا\n التي انتظرناها طويلا وبمصاعب حياتنا الدراسية \n التي عانينا منها جميعاً والكل عاش تلك اللحظات  \n  اليوم  اتت لحظه التخرج لتقول لنا بأن لا شيء مستحيل بحياتنا مهما كانت ، الصعاب   \n لحظه تَخرجنا يعُتبر ميلاد جديد لتحقيق كُل الأحلام التي حلمنا بهاَ   \n          اليوم هي هدية فرح   \n لأمي لأبي لأهلي لأحبتي الذين وقفوا بجانبي دائما \n  التوفيق والفرح والسعادة لكُل انسان يسعى لتحقيق حُلمه ......    ",
    },
    {
      'name' : 'وفاء ايوب ',
      'shortName' : 'وفاء ايوب',
      'type': 2 ,
      'image': 'abtsam.jpg',
      'title': 'لحظات .. ',
      'text' :"حين فكرت بكتابة حروفي تزاحمت في مخيلتي كلمات مابين فرح و حزن\n لا أدري كيف مرت مرحلتنا الجامعية رغم طول الفترة وصعوبة الأوضاع التي عشناها...   \n ضاعت الحروف وتاهت الجمل نقف متذكرين  \n ذلك اليوم الذي وطأة به اقدامنا هذا الصرح العلمي،  \n وماكان في قلوبنا حينها من خوف ومن مشاعر متفرقة لايصفها قلمي،  \n هذه ليست النهاية في مشوار حياتنا بل هي البداية  المشوار  \n لنوظف ما تعلمناه هنا في مسيرة حياتنا القادمة بإذن الله .    ",
    },
    {
      'name' : 'يسرى قاسم ',
      'shortName' : 'يسرى قاسم',
      'type': 2 ,
      'image': 'abtsam.jpg',
      'title': 'أنطوت صفحة من صفحات الحياة',
      'text' : "أنطوت صفحة من صفحات الحياة صفحة كان فيها الجد والاجتهاد رفيقاً على الدوام،\n ، لحظة نودع فيها الدراسة والتعب ونحصد فيها ثمرة اجتهادنا، \n مودعين فيها لحظات ضحكات الرفاق \n  وهانحن أفضل خريجين دفعة CTI  رافعين قبعات التخرج مودعين اربع سنين مضت. \n كما أهدي تخرجي إلى من حصد الأشواك عن دربي ليمهد لي طريق العلم\n (أمي وأبي) \n إلى من كانوا عوناً لي في مسيرتي وسندي في الحياة \n إخواتي\n إلى من أضاءوا قناديل العلم ومدوا أيديهم لنصل إلى شاطئ المعرفة  (أساتذتنا ودكاترتنا الأفاضل)      ",
    },
  ];
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: UtiliteColor.color1,
        title: Text('كلمة طالبات الدفعة',style: TextStyle(fontSize: 17,color: UtiliteColor.color5),),
      ),
      body: ListView.builder(
          itemCount: data.length,
          itemBuilder: (BuildContext ctxt, int index)
          {
            return Padding(
              padding: const EdgeInsets.only(top: 5,bottom: 5,right: 5,left: 5),
              child: FadeAnimation(.5, Container(
                color: UtiliteColor.color2.withOpacity(.7),
                child: Padding(
                  padding: const EdgeInsets.all(5),
                  child: ListTile(
                    onTap: (){
                      Navigator.push(context, MaterialPageRoute(builder:(context)=>infoWordsStudent(data: data[index],)));
                    },
                    title: data[index]['type']==1?Text("الخريج : " +data[index]['name'],style: TextStyle(fontSize: 15),)
                        :Text("الخريجة : " +data[index]['name'],style: TextStyle(fontSize: 15),),
                    leading: ClipRRect(
                      borderRadius: BorderRadius.circular(30),
                      child: data[index]['type']==1?Image.asset('assates/images/icons3.png'):Image.asset('assates/images/icons1.png'),
                    ),
                    trailing: Icon(Icons.arrow_back_ios),
                  ),
                ),
              ),
              ),
            );

          }),
    );
  }
}
